#import this

def calculate():
    a = int(input('Введите первое число: '))
    b = int(input('Введите второе число: '))
    c = int(input('Введите третье число: '))

    #находим сумму всех трех переменных
    sum = a + b + c
    print("Сумма: ", sum)

    #находим разность всех трех переменных
    difference = a - b - c
    print('Разность: ', difference)

    #находим произведение всех трех переменных
    product = a * b * c
    print('Произведение ', product)

    #от первой переменной отнять вторую и прибавить третью
    h1 = a - b + c
    print('a - b + c:', h1)

    #поделить произведение двух переменных на третью
    h2 = a * b / c
    print('a * b / c: ', h2)

    #от суммы первых двух переменных найти остаток от деления на третью переменную
    h3 = (a + b) % c
    print('(a + b) % c: ', h3)

calculate()